# Data Frames part 1


DataFrames are the workhorse of pandas and are directly inspired by the R programming language. We can think of a DataFrame as a bunch of Series objects put together to share the same index. Let's use pandas to explore this topic!

In [1]:
import pandas as pd
import numpy as np

In [4]:
# And what a seed means is just to make sure that we get the same random numbers.

from numpy.random import randn
np.random.seed(101)

In [5]:
# class pandas.DataFrame(data=None, index=None, columns=None, dtype=None, copy=False)

df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [6]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

### Notes:

Now each of these columns is actually just a panda's series.

So W is a panda series as well as X Y and Z and they all share a common index and that's basically all data frame is it's just a bunch of series that share an index.

In [7]:
# Returns the W column

df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

Now this actually looks like a series.

And that's because that's exactly what W column is.

It's just a series and you can actually confirm this by saying.

type(df['W']) and it shows that it's Pandas that core that series that series.

If I just say type(df) I will get a data frame out.

In [8]:
type(df['W'])

pandas.core.series.Series

In [9]:
type(df)

pandas.core.frame.DataFrame

If I just say type  typy(df) I will get a data frame out.

### Notes: 

Now there's two different ways you can grab a column from a data frame.

The main way and the way should always do it is using this sort of bracket notation and then passing the column name.

However if you're really familiar of SQL a lot of times you're selecting a column you pass in a table and then the column name.

This actually also works for pantless you could say dot and then the column name.

However I would recommend that you don't use this because it may get confused with the various methods that are available off of the data frame.

In [10]:
# SQL Syntax (NOT RECOMMENDED!)

df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

### Notes:

Those are a bunch of methods that we're going to learn about as we learn more about pandas but what may happen is that one of these methods gets overwritten by a column name and then Panther is going to get confused whether you're asking for a method or an actual column name.

DataFrame Columns are just Series

In [11]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

### Notes:

If you want multiple columns back then you can go ahead and pass a list of columns.

So know that I pass in my brackets and then I'm going to pass and a list of column names which is going to result in another set of brackets here.

And that means when I ask for multiple columns I'm actually getting back a data frame I asked for just a single column that I will get back a series.

In [1]:
a = [1]

In [3]:
my_list = [[3,4]]

In [5]:
a[0]

1

In [6]:
b = (1,2,3)

In [7]:
b[1]

2

**Creating a new column:**

Pandas supports creation of new columns by just specifying the column as if it already exists.

You can actually define it as if it already exists and then on the right hand side of the equal sign use other columns with arithmetic in order to pull off a new column.

In [12]:
df['new'] = df['W'] + df['Y']

In [13]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

**Removing Columns**

In [14]:
# axis{0 or ‘index’, 1 or ‘columns’}, default 0
# Whether to drop labels from the index (0 or ‘index’) or columns (1 or ‘columns’).


df.drop('new',axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

### Notes:

If I click shift tab on the drop method notice that by default it says access is equal to zero access equal to zero for the drop method refers to the index. 

If I actually want to refer to the columns I need to specify access is equal to 1 and then it will dropthat new column here.

Now there's two things to note when using this df.drop the first thing to know is that this doesn't happen in place meaning I'm not actually affecting the state of frame unless I specifically specify to this to occur in place.

I want to show you what I mean by that.

I've called this line DF.drop you access equal to 1 if I called df I'll see that I still have that

new column.

That means I need to actually specify as an argument to shift have to show it the in-place argument in many many Pandurs methods will require this in place arguments to be set to true. And the reason panderers does that is that for you not to accidentally lose information in case you've done a bunch of adjustments to your data you don't want to accidentally lose it.

So Pandas requires you to say in-place equals true if you actually want a lot of these changes to stay and occur in place.

In [15]:
# Not inplace unless specified!
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [16]:
df.drop('new',axis=1,inplace=True)

In [17]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

Since data frames are essentially just fancy index markers on top of a PI array to show this. I can say df.shape just like we did of a pipe matrix and no if that shape is a tuple for a tooth imaginal matrix here and at the zero index or the number of rows.

In [18]:
df.shape

(5, 4)

So if I say df here I have five rows. A B C D E and then on the index one I have four columns w x y z.

Which is why rows are referred to as the zero axis and columns are referred to as the one axis because it's directly taken from the shape just as you would have a numpy array.

**Can also drop rows this way:**

In [19]:
# Dropping rows

df.drop('E',axis=0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

**Selecting Rows**

- .loc[] is primarily label based, but may also be used with a boolean array.

- DataFrame.a Access a single value for a row/column label pair.

- DataFrame.iloc Access group of rows and columns by integer position(s).

- DataFrame.xs Returns a cross-section (row(s) or column(s)) from the Series/DataFrame.

- Series.loc Access group of values using labels.

For instance if I wanted the row I just passen.

See I passen the label of that index and this returns.

And this comes to our second conclusion that not only are all the columns series but the rows are series as well as far as the way they're going to get returns.

When you request them in Pandas.

In [20]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

Or select based off of position instead of label

I can use df.ilok to actually in a numerical index position even if my axes are labeled by strings.

In [21]:
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

And that basically means you have two ways of selecting rows using EHLO see if you want the location or labeled based index or I ellos see if you want the numerical based index.

**Selecting subset of rows and columns**

Like we did with numpy using common notation.

The row we want and then the column we want.

So I want the value at Row be column Y and this returns just a single value there.

In [22]:
df.loc['B','Y']

-0.8480769834036315

So just like numpy you can use this row comma column notation and if you want a subset of this.

In [23]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

# Data Frames part 2

### Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [24]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [25]:
df>0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [33]:
df['W']>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

### Notes:

A very important feature of pandas is the ability to perform conditional selection using bracket notation and this is going to be very similar to numpy for instance for a comparison operator against the data frame such as asking where is the data frame greater than zero.

I will get a data from back of boolean values where it returns true if the data frame value at that point was greater than zero and false if it was not greater than zero.

In [30]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

### Notes:

And here we have our boolean data frame and if we pass that in to our original data frame with bracket notation then we will get out as a result values where it was true and Knoll's or any n where it happened to be false.

And that's the way you can use conditional selection along with a data frame.

Well most likely you'll end up doing is instead of just passing in the entire data frame you'll pass in a row or a column value and instead of returning nulls what that's going to do is return only the rows or columns of a subset of the data frame where your conditions are true.

In [28]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [29]:
df[df['W']>0]['Y']

A    0.907969
B   -0.848077
D   -0.933237
E    2.605967
Name: Y, dtype: float64

### Notes: 


What I'm going to go ahead and do is specify W greater than zero and notice I get a series back.

True true false true true and this is linked to the actual index.

And if I take a look at the W column I see that this corresponds with the W column values and the value at index c it was actually less than zero.

So returns False for being greater than zero.

I can now use this series of boolean values corresponding to rows to filter out rows based off of a column value and that means if I pass in the series into a data frame using bracket notation to say something like df[W] > 0 I will only get back the rows where this happens to be true meaning I only get back the rows a b d and e it won't return row C since it was false here.

And now since I'm passing in a series I don't get those no values anymore you only get those no values when you're doing this sort of condition on an entire data frame when you're actually passing in conditions based off of columns.

You'll just get series values meaning you'll get only the rows were happens to be true and this is the sort of conditional selection we're going to be using most often throughout this course.

In [44]:
# First the condition and then the columns to be shown based on the filtering condition stablished in this case W > 0

df[df['W']>0][['Y','X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

### Notes: 

I can go ahead and say return the data frame where the column value of W happens to be greater than zero.

So return those rows to me.

That means all the rows minus the C row and since this is a data frame I can actually go ahead and stack commands such as bracket notation on top of that such as return the X column where that's true and now I get the same results as I did up here except it's all done in one step and this is something that can be intimidating to beginners at first.

So there's a lot of brackets and a lot of stuff going on here.

But essentially this is just instead of splitting everything up into multiple steps and putting it all into one step.

And likewise since this is a data frame I can bracket for multiple columns by passing in the lists such as why comma X and we can see we get a result here.

For two conditions you can use | and & with parenthesis:

In [39]:
# Another example but breaking down the idea

boolser = df['W']>0
boolser

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [38]:
# Now the False value is filtered out

result = df[boolser]
result

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [41]:
mycols = ['Y','X']

In [43]:
# The result is exactly the same as shown before

result = df[mycols]
result

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
C  0.528813  0.740122
D -0.933237 -0.758872
E  2.605967  1.978757

### Multiple conditions

But what if you wanted multiple conditions such as where w is greater than zero and Y was greater than 1.

Well what you could do is try something like this is in parentheses pass in one condition and then say and pass in another condition And this is going to return an error.

I'm going to do this on purpose to explain why there's an error happening here and this is a common mistake for beginners to put this and here and you'll get a mistake that says something about the series being ambiguous.

We scroll down here we see this the truth value of a series is ambiguous and what that is trying to say is that Python's normal and operator can't actually take into account a series of boolean values compared to another series of boolean values and operator can only take into account single booleans at a time.

So true and false returns False True and true returns true etc..

That means when you pass an entire series of boolean values such as this the and operator begins to get confused.

It's can only deal with these single instances of boolean values which is why when you're working with pandas and you want multiple conditions you actually have to use in ampersands which is this.

In [45]:
# Wrong way

df[(df['W']>0) and (df['Y'] > 1)]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

**Notice here that I'm passing these conditions in parentheses to show clear separation between each of these conditions.**

In [48]:
# & for AND


df[(df['W']>0) & (df['Y'] > 1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [47]:
# | OR

df[(df['W']>0) | (df['Y'] > 1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

### Notes:

You have to use the ampersand and then you pass in the multiple conditions in parentheses and then finally put it inside of brackets for your data frame.

If you want to do an OR operation you can just replace this with the pipe | operator which is right above your.

Usually for most keyboards on your Enter key go it go right above it and then do shift on that backslash and this should give you the pipe operator and that's going to be a replacement for OR because if you try using or you'll get the same error.

So that's with or if I try it with Python's normal or Again I'll get the truth value of a series is ambiguous.

And that's because you get a series of those values instead of just one or two boolean values.


### Resume: 

Basically if you want multiple conditions pass in each condition in parentheses and then use an ampersand (&) or pipe (|) operator for the ends or let's go ahead now and shift gears to talk about index and a little more details about it we're going to discuss now is resetting the index or setting it to something else.

## More Index Details

Let's discuss some more features of indexing, including resetting the index or setting it something else. We'll also talk about index hierarchy!

In [49]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [50]:
# Reset to default 0,1...n index
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

### Notes:

In order to reset the index back to the default which is just a range index or a 1 2 3 4 all the way up to the nth row. You can do is call the method reset underscore index and remember to close parentheses that we actually run that method.

If you call that notice you will get the index reset to a column and you'll get the actual index then to be numerical.

And that's how you can reset the index.

Something to note here is just like a lot of other hand those data from operations.

This doesn't occur in place unless you specify it for it to occur in place. So if I call back T.F. I still have that original index of labels if you want this to actually occur in place what you would do is say in place equals true and pass into the reset underscore index.

For now we'll go ahead and not do that.

That way we still retain our original data frame.

### Again

**You can just use that reset index and your old index will become a column of your data frame.**

In [ ]:
newind = 'CA NY WY OR CO'.split()

Remember that split off a string should say common method for splitting off a blank space.

But this is a nice quick way to create a list instead of having to type out every comma.

In [60]:
# So I have my new index values here and what I'm going to do is put this as a column in my data frame

df['States'] = newind

In [61]:
df

               W         X         Y         Z States
States
CA      2.706850  0.628133  0.907969  0.503826     CA
NY      0.651118 -0.319318 -0.848077  0.605965     NY
WY     -2.018168  0.740122  0.528813 -0.589001     WY
OR      0.188695 -0.758872 -0.933237  0.955057     OR
CO      0.190794  1.978757  2.605967  0.683509     CO

In [63]:
# Setting States as a index

df.set_index('States')

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

### Notes: 

But if you have a column in your data frame that you want to be the index which you can go ahead and do is say set index instead of reset index.

For example I can say DF dot set underscore index and then pass in the column name you want to be the new index so states here and if I do shift enter now the states column has become the index.

Keep in mind unless you retain this information of the index so overwrite your old index and you won't actually be able to retain this information as a new column.

Unlike resets index that allows you to have that new column.

So that's set index versus reset index.

In [55]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

### Notes: 

Again if I check out my data frame here this wasn't in place.

I would need to add the argument If I do shift enter here inplace = True

In [64]:
df.set_index('States',inplace=True)

In [57]:
df

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

Now it's inplace!

## Multi-Index and Index Hierarchy

Let us go over how to work with Multi-Index, first we'll create a quick example of what a Multi-Indexed DataFrame would look like:

In [4]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

Using the zip function and LIST on this in order to make this into a list of tuple pairs G 1 1 1 2 1 3 2 1 2 2 2 3.

And then I passed it into a special function from pandas and we were actually won't be working with this function at all throughout the course but this is just for a customization of making a data frame so don't worry too much about it but I just want you to be aware of it.

In [6]:
list(zip(outside,inside))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [5]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

So after you get done with that youll get this multi index with several levels.

In [8]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])

Now let's show how to index this! For index hierarchy we use df.loc[], if this was on the columns axis, you would just use normal bracket notation df[]. Calling one level of the index returns the sub-dataframe:

In [10]:
df

             A         B
G1 1  0.628661  1.892100
   2 -0.689342 -1.742495
   3 -0.523312  0.451305
G2 1  0.823049 -1.223032
   2  0.585184  0.820658
   3  0.667650 -1.318718

In [11]:
df.loc['G1']

          A         B
1  0.628661  1.892100
2 -0.689342 -1.742495
3 -0.523312  0.451305

In [12]:
df.loc['G1'].loc[1]

A    0.628661
B    1.892100
Name: 1, dtype: float64

It returns as a series from a multi index. 

So the basic idea is you call from the outside index continue calling inside deeper.

In [13]:
df.index.names

FrozenList([None, None])

That's notified about the fact that there's no name in these two cells which can go out into say df.index.names do shift enter and you should get a frozen list that's none none.

And this is just a pandas index names object types.

All it's saying here is that these indices don't have any names but you can go ahead and do say equals and then pass in a list of names.

In [14]:
df.index.names = ['Group','Num']

In [72]:
df

                  A         B
Group Num
G1    1    0.302665  1.693723
      2   -1.706086 -1.159119
      3   -0.134841  0.390528
G2    1    0.166905  0.184502
      2    0.807706  0.072960
      3    0.638787  0.329646

In [22]:
# Selecting as G1 subgroups

df.xs('G1')

            A         B
Num
1    0.628661  1.892100
2   -0.689342 -1.742495
3   -0.523312  0.451305

So this returns a cross section of rows or columns from a series of data frame and you're going to use this when you have a multilevel index.

In [21]:
# Selecting first line of G1 for both columns

df.xs(['G1',1])

A    0.628661
B    1.892100
Name: (G1, 1), dtype: float64

But what's nice about this cross section is it has the ability to skip or go inside a multilevel index.

For example let's say I have this data frame here and I want to grab all values of number equal to one with both groups in it.

In [75]:
df.xs(1,level='Num')

              A         B
Group
G1     0.302665  1.693723
G2     0.166905  0.184502

In [18]:
df

                  A         B
Group Num
G1    1    0.628661  1.892100
      2   -0.689342 -1.742495
      3   -0.523312  0.451305
G2    1    0.823049 -1.223032
      2    0.585184  0.820658
      3    0.667650 -1.318718

In [19]:
df.loc['G1'].loc[1]['B']

1.8921004502280414

In [20]:
df.loc['G2'].loc[2]['A']

0.5851843578460111